tutorials/multiphase/multiphaseEulerFoam/bubbleColumn/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
    air
    {
        rho             1;
        nu              1.6e-05;
        kappa           0;
        Cp              0;

        diameterModel   constant;
        constantCoeffs
        {
            d               3e-3;
        }
    }

    water
    {
        rho             1000;
        nu              1e-06;
        kappa           0;
        Cp              0;

        diameterModel constant;
        constantCoeffs
        {
            d               1e-4;
        }
    }
);


sigmas
(
);

interfaceCompression
(
);

virtualMass
(
    (air water)     0.5
);

drag
(
    (air water)
    {
        type blended;

        air
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        water
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        residualPhaseFraction 1e-3;
        residualSlip 1e-3;
    }
);


// This is a dummy to support the Smagorinsky model
transportModel  Newtonian;
nu              0;


// ************************************************************************* //
